# SpaceLightingScheduleParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceLightingScheduleParam Property
ParameterTypeId Class See Also
---
"Lighting Schedule"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceLightingScheduleParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceLightingScheduleParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceLightingScheduleParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace